import random
inventory=[]
day=1
health=70
input("""مرحبا بك في لعبة البقاء:""" )
input("بعد اسبوع شاق قررت أن تأخذ إجازة وتسافر إلى دولة أخرى")
input("لقد حجزت تذكرة السفر وانت الأن على متن الطائرة")
input("""وفي لحظة خاطفة, الطائرة تهتز بعنف وسط عاصفة سوداء,
 والصراخ والارتجاج يزدادان على متن الطائرة حتى ينكسر جسد الطائرة ويسقط نحو المجهول.""")
input("""حين فتحت عينيك, وجدت نفسك على شاطئ جزيرة مهجورة,
نصف الطائرة محطم, الرمال مبتلة بالدماء,
ولا أثر لأي مسافر آخر.""")
while True:
      chose1=input("""1-هل ستبحث عن ناجين
      2-ستجمع موارد من الحطام\n""")
      if chose1 == "1":
         input("تكتشف أنك الوحيد وتفقد الطاقة بسبب التعب")
         health-=10
         break
      elif chose1 == "2":
         lucky=random.randint(1,2)
         if lucky==1:
            input("لقد وجدت على سكين")
            inventory.append("سكين")
         else:
            input("لقد وجدت على علبة كبريت(ستفيدك لاحقاً)")
            inventory.append("علبة كبريت")
         break
      else:
         print("اختر أحد الخيارات المعروضة")
day+=1
print("-"*30)
print(f"بداية اليوم{day}")
print(f"صحتك الحالية{health}")
print(f"حقيبتك تحتوي على{inventory}")
input("أنت تشعر بالجوع الشديد ")
chose2=input("""1-أكل ثمار غريبة من شجرة قريبة
2-محاولة صيد سمكة بالسكين""")
while True:
    if chose2 == "1":
        lucky=random.randint(1,2)
        if lucky==1:
            print("كانت الثمار لذيذة, زادت صحتك")
            health+=15
        else:
            print("كانت الثمار مسمومة")
            health-=30
        break
    elif chose2=="2":
        if "سكين" in inventory:
            print("بما أنك تمتلك سكيناً, استطعت صيد سمكة كبيرة")
            health+=20
        else:
            print("حاولت الصيد بيدك وفشلت. ضاع وقتك وجهدك")
            health-=10
        break
    else:
        print("اختر أحد الخيارات المعروضة")
if health<=0:
    print("للأسف فقدت كل صحتك. لقد مت وحيداً على الجزيرة")
else:
    print(f"أحسنت نجوت حتى نهاية اليوم الثاني بصحة {health}")