import random
inventory=[]
day=1
health=70
print("""مرحبا بك في لعبة البقاء:""" )
input("في كل مرة عليك الضغط على (enter) للإكمال الحديث")
input("بعد اسبوع شاق قررت أن تأخذ إجازة وتسافر إلى دولة أخرى")
input("لقد حجزت تذكرة السفر وانت الأن على متن الطائرة")
input("""وفي لحظة خاطفة, الطائرة تهتز بعنف وسط عاصفة سوداء,
 والصراخ والارتجاج يزدادان على متن الطائرة حتى ينكسر جسد الطائرة ويسقط نحو المجهول.""")
input("""حين فتحت عينيك, وجدت نفسك على شاطئ جزيرة مهجورة,
نصف الطائرة محطم, الرمال مبتلة بالدماء,
ولا أثر لأي مسافر آخر.""")
while True:
      chose1=input("""1-هل ستبحث عن ناجين
      2-ستجمع موارد من الحطام\n""")
      if chose1 == "1":
         input("تكتشف أنك الوحيد وتفقد الطاقة بسبب التعب")
         health-=10
         break
      elif chose1 == "2":
         lucky=random.randint(1,2)
         if lucky==1:
            input("لقد وجدت على سكين")
            inventory.append("سكين")
         else:
            input("لقد وجدت على علبة كبريت(ستفيدك لاحقاً)")
            inventory.append("علبة كبريت")
         break
      else:
         print("اختر أحد الخيارات المعروضة")
day+=1
print("-"*30)
print(f"بداية اليوم{day}")
print(f"صحتك الحالية{health}")
print(f"حقيبتك تحتوي على{inventory}")
input("أنت تشعر بالجوع الشديد ")
chose2=input("""1-أكل ثمار غريبة من شجرة قريبة
2-محاولة صيد سمكة بالسكين""")
while True:
    if chose2 == "1":
        lucky=random.randint(1,2)
        if lucky==1:
            print("كانت الثمار لذيذة, زادت صحتك")
            health+=15
        else:
            print("كانت الثمار مسمومة")
            health-=30
        break
    elif chose2=="2":
        if "سكين" in inventory:
            print("بما أنك تمتلك سكيناً, استطعت صيد سمكة كبيرة")
            health+=20
        else:
            print("حاولت الصيد بيدك وفشلت. ضاع وقتك وجهدك")
            health-=10
        break
    else:
        print("اختر أحد الخيارات المعروضة")
input("السماء ستظلم قريباً.")
print("قررت البحث عن المعدات اللازمة لبناء ملجأ")
lucky=random.randint(30,100)
input(f" لقد وجدت {lucky}خشب ")
if lucky>=40:
    print("لديك ما يكفي لبناء ملجأ دافئاً")
else:
    print("ليس لديك ما يكفي من الخشب لبناء الملجأ")
    input("ستنام في العراء ويهاجمك البعوض وتنقص صحتك")
    health-=10
if health<=0:
    print("للأسف فقدت كل صحتك. لقد مت وحيداً على الجزيرة")
    print("انتهت اللعبة")
else:
    print(f"أحسنت نجوت حتى نهاية اليوم الثاني بصحة {health}")
    day+=1
    print("-"*30)
    print(f"بداية اليوم{day}")
    print(f"صحتك الحالية{health}")
    print(f"حقيبتك تحتوي على{inventory}")
    input("استيقظت في الصباح الباكر على صوت تكسير اغصان من داخل الغابة")
    chose3=input("""1-الاختباء (يتطلب ملجأ)
    2-الهجوم (يتطلب سكين أو صحة عالية)\n""")
    while True:
        if chose3 == "1":
            print("لقد اختبأت في الملجأ وكتمت الأنفاس, يمر الوحش(فهد أسود) بجانبك ولا يراك")
            break
        elif chose3 == "2":
            if "سكين" in inventory and health>=70:
               print("تندفع نحو الظلال وتقرر مواجهة الوحش")
               input("إذا كان معك سكين, تجرح الوحش ويهرب, لكنك تفقد 15 صحة")
               health-=15
            elif "سكين" not in inventory and health>=70:
                print("تندفع نحو الظلال وتقرر مواجهة الوحش")
                input("تصارع بيدك وتفقد 50 صحة(مخاطرة كبرى!)")
                health-=50
            elif "سكين" not in inventory and health<70:
                print("لا تستطيع المواجهة")
                input("لقد اختبأت في الملجأ وكتمت الأنفاس, يمر الوحش(فهد أسود) بجانبك ولا يراك")
            break
        else:
            print("اتخذ أحد الخيارات بسرعة")
    input("تقرر الهروب من الجزيرة, لديك طريقان للهروب")
    chose4=input("""1-الهروب عن طريق صنع قارب
    2-الهروب عن طريق صنع إشارة دخان""")
    while True:
        if chose4 == "1":
            input("تقرر البحث عن المعدات الازمة لصنع قارب")
            input("تذهب للبحث في حطام الطائرة عن ما يمكنك استخدامه")
            input("ابتسم الحظ لك ووجدت(حبال,طعام,بوصلة)")
            input("والآن تبدأ بصنع القارب")
            day+=3
            print("-"*30)
            print(day)
            input("لقد استغرق منك صنع القارب 3 أيام, وبعد كل التعب استطعت الهروب من الجزيرة")
            input("في طريقك في البحر تجدك سفينة تجارية وتنقذك وتعيدك إلى الديار")
            break
        elif chose4 == "2":
            if "علبة كبريت" in inventory:
                print("تحتاج إلى جمع أوراق شجر جافة")
                input("اكملت جمع الاوراق ولديك علبة كبريت,الآن تحتاج الصعود إلى اعلى قمة في الجزيرة")
                input("بعد التعب كله تكمل إشعال النار, ويتصاعد الدخان عالياً")
                input("تمر طائرة وتكاد لا تراك, لكن الدخان الكثيف يلفت انتباه الطائرة")
                input("تهبط الطائرة وتنقذك")
            elif "علبة كبريت" not in inventory:
                input("لا تمتلك علبة كبريت لإشعال النار, فتقرر إشعالها بطرق بدائية")
                print("تحتاج إلى جمع أوراق شجر جافة")
                input("اكملت جمع الاوراق,الآن تحتاج الصعود إلى اعلى قمة في الجزيرة")
                input("بعد التعب كله تكمل إشعال النار, ويتصاعد الدخان عالياً")
                input("تمر طائرة وتكاد لا تراك, لكن الدخان الكثيف يلفت انتباه الطائرة")
                input("تهبط الطائرة وتنقذك")
            break
        else:
            print("اختر أحد الخيارات المعروضة")
    print("لقد عدت إلى الوطن")