print("""مرحبا بك في لعبتنا(mini games)
في هذه اللعبة ستظهر لك مجموعة العاب ولك الحرية في إختيار أي واحدة""")
while True:
    game=input("""1-survival
    2-guessing the number
    3-find the treasure
    فقط اختر رقم اللعبة\n""")
    if game=="1":
        import random
        inventory = []
        day = 1
        health = 70
        print("""مرحبا بك في لعبة البقاء:""")
        input("في كل مرة عليك الضغط على (enter) للإكمال الحديث")
        input("بعد اسبوع شاق قررت أن تأخذ إجازة وتسافر إلى دولة أخرى")
        input("لقد حجزت تذكرة السفر وانت الأن على متن الطائرة")
        input("""وفي لحظة خاطفة, الطائرة تهتز بعنف وسط عاصفة سوداء,
         والصراخ والارتجاج يزدادان على متن الطائرة حتى ينكسر جسد الطائرة ويسقط نحو المجهول.""")
        input("""حين فتحت عينيك, وجدت نفسك على شاطئ جزيرة مهجورة,
        نصف الطائرة محطم, الرمال مبتلة بالدماء,
        ولا أثر لأي مسافر آخر.""")
        while True:
            chose1 = input("""1-هل ستبحث عن ناجين
              2-ستجمع موارد من الحطام\n""")
            if chose1 == "1":
                input("تكتشف أنك الوحيد وتفقد الطاقة بسبب التعب")
                health -= 10
                break
            elif chose1 == "2":
                lucky = random.randint(1, 2)
                if lucky == 1:
                    input("لقد وجدت على سكين")
                    inventory.append("سكين")
                else:
                    input("لقد وجدت على علبة كبريت(ستفيدك لاحقاً)")
                    inventory.append("علبة كبريت")
                break
            else:
                print("اختر أحد الخيارات المعروضة")
        day += 1
        print("-" * 30)
        print(f"بداية اليوم{day}")
        print(f"صحتك الحالية{health}")
        print(f"حقيبتك تحتوي على{inventory}")
        input("أنت تشعر بالجوع الشديد ")
        chose2 = input("""1-أكل ثمار غريبة من شجرة قريبة
        2-محاولة صيد سمكة بالسكين""")
        while True:
            if chose2 == "1":
                lucky = random.randint(1, 2)
                if lucky == 1:
                    print("كانت الثمار لذيذة, زادت صحتك")
                    health += 15
                else:
                    print("كانت الثمار مسمومة")
                    health -= 30
                break
            elif chose2 == "2":
                if "سكين" in inventory:
                    print("بما أنك تمتلك سكيناً, استطعت صيد سمكة كبيرة")
                    health += 20
                else:
                    print("حاولت الصيد بيدك وفشلت. ضاع وقتك وجهدك")
                    health -= 10
                break
            else:
                print("اختر أحد الخيارات المعروضة")
        input("السماء ستظلم قريباً.")
        print("قررت البحث عن المعدات اللازمة لبناء ملجأ")
        lucky = random.randint(30, 100)
        input(f" لقد وجدت {lucky}خشب ")
        if lucky >= 40:
            print("لديك ما يكفي لبناء ملجأ دافئاً")
        else:
            print("ليس لديك ما يكفي من الخشب لبناء الملجأ")
            input("ستنام في العراء ويهاجمك البعوض وتنقص صحتك")
            health -= 10
        if health <= 0:
            print("للأسف فقدت كل صحتك. لقد مت وحيداً على الجزيرة")
            print("انتهت اللعبة")
        else:
            print(f"أحسنت نجوت حتى نهاية اليوم الثاني بصحة {health}")
            day += 1
            print("-" * 30)
            print(f"بداية اليوم{day}")
            print(f"صحتك الحالية{health}")
            print(f"حقيبتك تحتوي على{inventory}")
            input("استيقظت في الصباح الباكر على صوت تكسير اغصان من داخل الغابة")
            chose3 = input("""1-الاختباء (يتطلب ملجأ)
            2-الهجوم (يتطلب سكين أو صحة عالية)\n""")
            while True:
                if chose3 == "1":
                    print("لقد اختبأت في الملجأ وكتمت الأنفاس, يمر الوحش(فهد أسود) بجانبك ولا يراك")
                    break
                elif chose3 == "2":
                    if "سكين" in inventory and health >= 70:
                        print("تندفع نحو الظلال وتقرر مواجهة الوحش")
                        input("إذا كان معك سكين, تجرح الوحش ويهرب, لكنك تفقد 15 صحة")
                        health -= 15
                    elif "سكين" not in inventory and health >= 70:
                        print("تندفع نحو الظلال وتقرر مواجهة الوحش")
                        input("تصارع بيدك وتفقد 50 صحة(مخاطرة كبرى!)")
                        health -= 50
                    elif "سكين" not in inventory and health < 70:
                        print("لا تستطيع المواجهة")
                        input("لقد اختبأت في الملجأ وكتمت الأنفاس, يمر الوحش(فهد أسود) بجانبك ولا يراك")
                    break
                else:
                    print("اتخذ أحد الخيارات بسرعة")
            input("تقرر الهروب من الجزيرة, لديك طريقان للهروب")
            chose4 = input("""1-الهروب عن طريق صنع قارب
            2-الهروب عن طريق صنع إشارة دخان""")
            while True:
                if chose4 == "1":
                    input("تقرر البحث عن المعدات الازمة لصنع قارب")
                    input("تذهب للبحث في حطام الطائرة عن ما يمكنك استخدامه")
                    input("ابتسم الحظ لك ووجدت(حبال,طعام,بوصلة)")
                    input("والآن تبدأ بصنع القارب")
                    day += 3
                    print("-" * 30)
                    print(day)
                    input("لقد استغرق منك صنع القارب 3 أيام, وبعد كل التعب استطعت الهروب من الجزيرة")
                    input("في طريقك في البحر تجدك سفينة تجارية وتنقذك وتعيدك إلى الديار")
                    break
                elif chose4 == "2":
                    if "علبة كبريت" in inventory:
                        print("تحتاج إلى جمع أوراق شجر جافة")
                        input("اكملت جمع الاوراق ولديك علبة كبريت,الآن تحتاج الصعود إلى اعلى قمة في الجزيرة")
                        input("بعد التعب كله تكمل إشعال النار, ويتصاعد الدخان عالياً")
                        input("تمر طائرة وتكاد لا تراك, لكن الدخان الكثيف يلفت انتباه الطائرة")
                        input("تهبط الطائرة وتنقذك")
                    elif "علبة كبريت" not in inventory:
                        input("لا تمتلك علبة كبريت لإشعال النار, فتقرر إشعالها بطرق بدائية")
                        print("تحتاج إلى جمع أوراق شجر جافة")
                        input("اكملت جمع الاوراق,الآن تحتاج الصعود إلى اعلى قمة في الجزيرة")
                        input("بعد التعب كله تكمل إشعال النار, ويتصاعد الدخان عالياً")
                        input("تمر طائرة وتكاد لا تراك, لكن الدخان الكثيف يلفت انتباه الطائرة")
                        input("تهبط الطائرة وتنقذك")
                    break
                else:
                    print("اختر أحد الخيارات المعروضة")
            print("لقد عدت إلى الوطن")
        print()
    elif game=="2":
        print("welcome to guessing the number game")
        name = input("enter your name: ")
        print("Welcome,", name + "!")
        print("Are you ready to beat the computer 💪?")
        input()
        print("LET'S GO!!")
        import random

        number = random.randint(1, 20)
        guess = 0
        attempts = 3
        while guess != number and attempts > 0:
            guess = int(input(f"Enter your guess: (1 to 20) ({attempts} left)\n "))
            attempts -= 1
            if attempts > 0:
                if guess < number:
                    print(f"Guess higher!")
                elif guess > number:
                    print(f"Guess lower!")
                elif guess == number:
                    print("YOU WIN! COMPUTER DEFEATED! 🎉🎉🏆")
            else:
                print("sorry, you lose!")
        print(f"The computer number was {number}")
        print()
    elif game=="3":
        name = input("ادخل اسمك")
        print("المرحلة الاولى:المحل الغريب")
        input("دخلت محل غريب مليء بالخرائط والتماثيل القديمة")
        input("يلاحظ صاحب المحل شجاعتك ويخبرك عن كنز اسطوري مفقود")
        input("يعطيك نصف خريطة ويقول لك إن النصف الآخر موجود في الغابة")
        input("وقبل ان تغادر للغابة تأخذ معك شعلة من النار لأنارة الطريق، وايضاً فأس صغير كأحتياط")
        print("المرحلة الثانية:الطريق للغابة")
        input("تسمع اصوات غريبة من الغابة, الظلام من حولك، فجأة يظهر دب ضخم يريد الهجوم عليك")
        answer = input("""1-تستخدم الفأس لقتله
        2-تستخدم النار لإخافته""")
        if answer == "2":
            input("يخاف الدب ويبتعد وتنجو\n")
        else:
            input("\nتقرر مواجهة الدب وبصعوبة تستطيع جرحه وجعله يهرب")
        print("المرحلة الثالثة:الكهف المظلم")
        input("عندما تصل الكهف لتأخذ قسطاً من الراحة، في داخل الكهف تلاحظ رسومات")
        input("تدل هذه الرسومات على مكان الجزء الثاني من الخريطة ،وتوضح انها مدفونه تحت شجرة كبيرة")
        input("تخرج من الكهف وتحفر بجانب الشجرة بأستخدام الفأس, لتجد الجزء الثاني من الخريطة")
        print("المرحلة الرابعة:الغموض والشك")
        input("بعد أن حصلت على الخريطة الكاملة، تقرر التوجه نحو مكان الكنز")
        input("وفي الطريق، تواجه جسر قديم مكسور، وأصوات غامضة، ولغز حجري عند مدخل الوادي")
        print("المرحلة الخامسة:الخيانة الكبرى و الألغاز")
        input("عندما تصل تكتشف أن صاحب المحل كان يتبعك سراً")
        input("تدخل وصاحب المحل الغرفة الاولى تكون مليئة بالألغاز و الفخاخ")
        input("يندفع صاحب المحل بسرعة ويضغط على أحد الأزرار الخطأ")
        input("فجأة تهتز الارضية، وتتحرك الحجارة، وينفتح فخ مخفي تحت قدميه")
        input("يسقط في حفرة مليئة بالمسامير الحجرية الحادة، ويغلق السقف فوقه")
        input("صدى صرخاته يتلاشى في الغرفة، ثم يعم الصمت ويموت")
        input("احذر الغرفة مليئة بالألغاز والفخاخ")
        input("أمامك خياران")
        answer = input("""1-تضغط الزر الأول
        2-تضغط الزر الثاني""")
        if answer == "1":
            input("تتحرك الحجارة وتسقط الارضية وتموت كما حدث لصاحب المحل")
        else:
            input("تنجو")
            print("المرحلة السادسة:غرفة الكنز")
            input("بعد موت صاحب المحل في الغرفة الأولى، تدخل الغرفة الثانية وحدك")
            input("الغرفة مظلمة وكبيرة، الجدران مليئة برموز غامضة تضيء وتختفي بشكل متقطع")
            input("والأرضية عبارة عن بلاطات، بعضها ثابت وامن، وبعضها ينفتح فجأة كفخ إذا داس عليها أحد")
            input("تجد الصندوق في وسط الغرفة, لكن الصندوق مقفل بثلاثة أقفال، وأمامك ثلاثة تماثيل: (أسد، صقر، ثعبان)")
            print("""على الجدار لوحة غامضة تقول:
                - وزن الأسد يساوي وزن صقرين
                - وزن الصقر يساوي وزن ثعبانين
                - إذا كان وزن الثعبان الواحد هو (5 كجم)، كم يجب أن يكون وزن الأسد لفتح القفل؟""")
            answer = input("أدخل الوزن الصحيح للأسد (رقم فقط): ")
            if answer == "20":
                print("نجاح باهر")
                input("تسمع صوت تروس تتحرك... ينفتح الصندوق وتشع منه الجواهر")
                input(f"مبروك يا {name}لقد هزمت الفخاخ بذكائك وخرجت ثرياً.")
            else:
                print("نهاية حزينة")
                input("أدخلت وزناً خاطئاً! اهتزت الجدران وانطبق السقف على الغرفة")
                print("صاحب المحل لن يكون وحيداً في القبر بعد الآن...")
        print()
    elif game=="0":
        print("شكرا لإستخدامك لعبتنا")
        break
    else:
        print("اختر أحد الخيارات المعروضة")
        print()